var orderList = [
    {
     	"id":"D2017102920323320",
     	"transportList": [
     		{
         		"id": "Y2017102920323320",
                "status": "运输中",
                "carNumber": "川A99999",
                "currentPos": {
                    "pos": ["104.012031","30.668811"],
                    "time": "2017-10-30 20:45:29",
                    "address": "中国四川省成都市青羊区东坡路"
                }
         	}, 
     		{
         		"id": "Y2017102920323321",
                "status": "运输中",
                "carNumber": "川A12345",
                "currentPos": {
                	"pos": [111.926433, 38.569585],
                    "time": "2017-10-30 20:45:29",
                     "address": "山西省忻州市静乐县"
                }
         	}
     	]
    },
    {
        "id":"D2017102920323321",
        "transportList": [
            {
                "id": "Y2017102920323323",
                "status": "运输中",
                "carNumber": "粤A44444",
                "currentPos": {
                	"pos" : [112.710881, 35.015931],
                    "time": "2017-10-30 20:45:29",
                    "address": "中国四川省成都市青羊区东坡路"
                }
            }, 
            {
                "id": "Y2017102920323324",
                "status": "运输中",
                "carNumber": "陕A33333",
                "currentPos": {
                    "pos" : [113.511351, 32.315865],
                    "time": "2017-10-30 20:45:29",
                    "address": "湖北省随州市随县"
                }
            }
        ]
    }
];