var testData = 
//[
//    {
//        "id": "Y2017102920323320",
//        "status": "运输中",
//        "transportType": "普通药物",
//        "goods": [
//            {
//                "name": "板蓝根",
//                "factory": "太极制药",
//                "number": "50"
//            },
//            {
//                "name": "同仁堂蜜丸",
//                "factory": "同仁堂",
//                "number": "25"
//            }
//        ],
//        "currentPos": {
//            "addr": "addr16",
//            "pos" : [108.581289, 34.022743],
//            "time" : "2017-08-12 13:56:02"
//        },
//        "dispatchData": [
//            {
//                "id": "Z2017102920330322_1",
//                "startPos": {
//                    "addr" : "陕西省西安市户县",
//                    "pos" : [108.585726, 34.022683]
//                },
//                "endPos": {
//                    "addr": "addr10",
//                    "pos" : [108.58288, 34.023229]
//                },
//                "portraitUrl": "https://pic.renyaoxing.com/FsSRl1J4AnyTbRi2Ao4M8GtiPL1f?e=1509288231&token=l0Aa0zIddqS9G3X8S-GUFAtsUCKC9HsNATcjnLxJ:CxDw0NEAcmwJsq3UFMQYQWnK674=",
//                "name": "付代成",
//                "tel": "13458588890",
//                "driveTime": "000000510101079302",
//                "carNumber": "川A99999",
//                "company": "承运商B",
//                "consignor": "货主公司A",
//                "consignee": "张家口第一人民医院",
//                "containerTemp": "-2℃",
//                "outdoorTemp": "33℃",
//                "posList": [
//                    {
//                    	"addr": "addr1zzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzssssssssssswwwwwwwwww",
//                        "pos" : [108.585726, 34.022683],
//                        "time" : "2017-08-12 13:31:02"
//                    }, {
//                    	"addr": "addr2",
//                        "pos" : [108.58482, 34.022569],
//                        "time" : "2017-08-12 13:32:42"
//                    }, {
//                    	"addr": "addr3",
//                        "pos" : [108.584104, 34.022708],
//                        "time" : "2017-08-12 13:34:22"
//                    }, {
//                    	"addr": "addr4",
//                        "pos" : [108.583696, 34.022822],
//                        "time" : "2017-08-12 13:36:02"
//                    }, {
//                    	"addr": "addr5",
//                        "pos" : [108.583049, 34.022691],
//                        "time" : "2017-08-12 13:37:42"
//                    }, {
//                    	"addr": "addr6",
//                        "pos" : [108.58283, 34.022708],
//                        "time" : "2017-08-12 13:39:22"
//                    }, {
//                    	"addr": "addr7",
//                        "pos" : [108.582602, 34.022794],
//                        "time" : "2017-08-12 13:41:02"
//                    }, {
//                    	"addr": "addr8",
//                        "pos" : [108.582562, 34.022843],
//                        "time" : "2017-08-12 13:42:42"
//                    }, {
//                    	"addr": "addr9",
//                        "pos" : [108.582791, 34.023007],
//                        "time" : "2017-08-12 13:44:22"
//                    }, {
//                    	"addr": "addr10",
//                        "pos" : [108.58288, 34.023229],
//                        "time" : "2017-08-12 13:46:02"
//                    }
//                ]
//            },
//            {
//                "id": "Z2017102920330322_2",
//                "startPos": {
//                    "addr" : "addr10",
//                    "pos" : [108.58288, 34.023229]
//                },
//                "endPos": {
//                    "addr": "addr16",
//                    "pos" : [108.581289, 34.022743]
//                },
//                "portraitUrl": "https://pic.renyaoxing.com/FsSRl1J4AnyTbRi2Ao4M8GtiPL1f?e=1509288231&token=l0Aa0zIddqS9G3X8S-GUFAtsUCKC9HsNATcjnLxJ:CxDw0NEAcmwJsq3UFMQYQWnK674=",
//                "name": "fjs",
//                "tel": "13458588890",
//                "driveTime": "000000510101079302",
//                "carNumber": "川A99999",
//                "company": "承运商B",
//                "consignor": "货主公司A",
//                "consignee": "成都第一人民医院",
//                "containerTemp": "-3℃",
//                "outdoorTemp": "25℃",
//                "posList": [
//                    {
//                        "addr": "addr10",
//                        "pos" : [108.58288, 34.023229],
//                        "time" : "2017-08-12 13:46:02"
//                    }, {
//                    	"addr": "addr11",
//                        "pos" : [108.58285, 34.023378],
//                        "time" : "2017-08-12 13:47:42"
//                    }, {
//                    	"addr": "addr12",
//                        "pos" : [108.58277, 34.023437],
//                        "time" : "2017-08-12 13:49:22"
//                    }, {
//                    	"addr": "addr13",
//                        "pos" : [108.582641, 34.023445],
//                        "time" : "2017-08-12 13:51:02"
//                    }, {
//                    	"addr": "addr4",
//                        "pos" : [108.582174, 34.023187],
//                        "time" : "2017-08-12 13:52:42"
//                    }, {
//                    	"addr": "addr15",
//                        "pos" : [108.581597, 34.022968],
//                        "time" : "2017-08-12 13:54:22"
//                    }, {
//                    	"addr": "addr16",
//                        "pos" : [108.581289, 34.022743],
//                        "time" : "2017-08-12 13:56:02"
//                    }
//                ]
//            }
//        ]
//    },
//    {
//        "id": "Y2017102920323320@1",
//        "status": "运输中",
//        "transportType": "普通药物",
//        "goods": [
//            {
//                "name": "板蓝根",
//                "factory": "太极制药",
//                "number": "50"
//            },
//            {
//                "name": "同仁堂蜜丸",
//                "factory": "同仁堂",
//                "number": "25"
//            }
//        ],
//        "currentPos": {
//            "addr": "addr5",
//            "pos" : [111.92297, 38.569356],
//            "time" : "2017-08-10 12:31:02"
//        },
//        "dispatchData": [
//            {
//                "id": "Z2017102920351585",
//                "startPos": {
//                    "addr" : "山西省忻州市静乐县",
//                    "pos" : [111.926433, 38.569585]
//                },
//                "endPos": {
//                    "addr" : "内蒙古自治区阿拉善盟阿拉善左旗",
//                    "pos" : [104.047109, 37.538265]
//                },
//                "portraitUrl": "https://pic.renyaoxing.com/FuHxbw7PXImmLz3_ydIXJyY7S3Id?e=1509288231&token=l0Aa0zIddqS9G3X8S-GUFAtsUCKC9HsNATcjnLxJ:LA5s8QO4y8Zea1GVOPVcOF961Z0=",
//                "name": "张师傅",
//                "tel": "18988888888",
//                "driveTime": "驾驶证L123456",
//                "carNumber": "川A1234578",
//                "company": "承运商B",
//                "consignor": "货主公司A",
//                "consignee": "上海RDC中心",
//                "containerTemp": "-3℃",
//                "outdoorTemp": "30℃",
//                "posList": [
//                    {
//                    	"addr": "山西省忻州市静乐县",
//                        "pos" : [111.926433, 38.569585],
//                        "time" : "2017-08-10 12:22:42"
//                    }, {
//                    	"addr": "addr1",
//                        "pos" : [111.926433, 38.569585],
//                        "time" : "2017-08-10 12:24:22"
//                    }, {
//                    	"addr": "addr2",
//                        "pos" : [111.926244, 38.569572],
//                        "time" : "2017-08-10 12:26:02"
//                    }, {
//                    	"addr": "addr3",
//                        "pos" : [111.925269, 38.569058],
//                        "time" : "2017-08-10 12:27:42"
//                    }, {
//                    	"addr": "addr4",
//                        "pos" : [111.923637, 38.568965],
//                        "time" : "2017-08-10 12:29:22"
//                    }, {
//                    	"addr": "addr5",
//                        "pos" : [111.92297, 38.569356],
//                        "time" : "2017-08-10 12:31:02"
//                    }
//                ]
//            }
//        ]
//    }
//]

[
    {
        "id": "Y2017103017183072@1",
        "status": "运输中",
        "transportType": "普通药物",
        "goods": [
            {
                "name": "这个是一种药",
                "factory": "太极制药",
                "number": "70"
            },
            {
                "name": "第二种药品",
                "factory": "开关柜看生成",
                "number": "25"
            }
        ],
        "currentPos": {
            "pos": [
                "104.012031",
                "30.668811"
            ],
            "time": "2017-10-30 20:45:29",
            "address": "中国四川省成都市青羊区东坡路"
        },
        "dispatchData": [
            {
                "id": "Z2017103017201855",
                "startPos": {
                    "address": "四川省成都市青羊区理想中心4栋1402号",
                    "pos": []
                },
                "endPos": {
                    "address": "重庆重庆市万州区万州汽车站",
                    "pos": []
                },
                "portraitUrl": "https://pic.renyaoxing.com/FnxEEZG0jbLpGDJn2W4EJ3lFyRwv?e=1509373961&token=l0Aa0zIddqS9G3X8S-GUFAtsUCKC9HsNATcjnLxJ:pCQarYWh0lGYtyjMgA5A5R70Khk=",
                "name": "刘兆磊",
                "tel": "18900008888",
                "driveTime": "510100197405050890",
                "carNumber": "川A 19938",
                "company": "货主公司A",
                "consignor": "货主公司A",
                "consignee": "开裆裤刷卡的飞",
                "containerTemp": "-3℃",
                "outdoorTemp": "30℃",
                "posList": [
                    {
                        "pos": [
                            "104.069344",
                            "30.600637"
                        ],
                        "time": "2017-10-30 17:23:04",
                        "address": "中国四川省成都市武侯区天益街38号-4栋-附12号"
                    },
                    {
                        "pos": [
                            "104.069344",
                            "30.600637"
                        ],
                        "time": "2017-10-30 17:24:04",
                        "address": "中国四川省成都市武侯区天益街38号-4栋-附12号"
                    },
                    {
                        "pos": [
                            "104.069344",
                            "30.600637"
                        ],
                        "time": "2017-10-30 17:25:04",
                        "address": "中国四川省成都市武侯区天益街38号-4栋-附12号"
                    },
                    {
                        "pos": [
                            "104.069344",
                            "30.600637"
                        ],
                        "time": "2017-10-30 17:26:04",
                        "address": "中国四川省成都市武侯区天益街38号-4栋-附12号"
                    },
                    {
                        "pos": [
                            "104.069344",
                            "30.600637"
                        ],
                        "time": "2017-10-30 17:27:04",
                        "address": "中国四川省成都市武侯区天益街38号-4栋-附12号"
                    },
                    {
                        "pos": [
                            "104.069344",
                            "30.600637"
                        ],
                        "time": "2017-10-30 17:30:40",
                        "address": "中国四川省成都市武侯区天益街38号-4栋-附12号"
                    },
                    {
                        "pos": [
                            "104.083734",
                            "30.647613"
                        ],
                        "time": "2017-10-30 17:31:19",
                        "address": "中国四川省成都市武侯区龙江路14-9号"
                    },
                    {
                        "pos": [
                            "104.069344",
                            "30.600637"
                        ],
                        "time": "2017-10-30 17:33:24",
                        "address": "中国四川省成都市武侯区天益街38号-4栋-附12号"
                    },
                    {
                        "pos": [
                            "104.069344",
                            "30.600637"
                        ],
                        "time": "2017-10-30 17:34:24",
                        "address": "中国四川省成都市武侯区天益街38号-4栋-附12号"
                    },
                    {
                        "pos": [
                            "104.069344",
                            "30.600637"
                        ],
                        "time": "2017-10-30 17:35:32",
                        "address": "中国四川省成都市武侯区天益街38号-4栋-附12号"
                    },
                    {
                        "pos": [
                            "104.069344",
                            "30.600637"
                        ],
                        "time": "2017-10-30 17:36:32",
                        "address": "中国四川省成都市武侯区天益街38号-4栋-附12号"
                    },
                    {
                        "pos": [
                            "104.069344",
                            "30.600637"
                        ],
                        "time": "2017-10-30 17:37:32",
                        "address": "中国四川省成都市武侯区天益街38号-4栋-附12号"
                    },
                    {
                        "pos": [
                            "104.083734",
                            "30.647601"
                        ],
                        "time": "2017-10-30 17:38:20",
                        "address": "中国四川省成都市武侯区龙江路14-9号"
                    },
                    {
                        "pos": [
                            "104.069344",
                            "30.600637"
                        ],
                        "time": "2017-10-30 17:40:04",
                        "address": "中国四川省成都市武侯区天益街38号-4栋-附12号"
                    },
                    {
                        "pos": [
                            "104.069344",
                            "30.600637"
                        ],
                        "time": "2017-10-30 17:41:04",
                        "address": "中国四川省成都市武侯区天益街38号-4栋-附12号"
                    },
                    {
                        "pos": [
                            "104.069344",
                            "30.600637"
                        ],
                        "time": "2017-10-30 17:42:04",
                        "address": "中国四川省成都市武侯区天益街38号-4栋-附12号"
                    },
                    {
                        "pos": [
                            "104.069344",
                            "30.600637"
                        ],
                        "time": "2017-10-30 17:43:04",
                        "address": "中国四川省成都市武侯区天益街38号-4栋-附12号"
                    },
                    {
                        "pos": [
                            "104.083734",
                            "30.647601"
                        ],
                        "time": "2017-10-30 17:43:21",
                        "address": "中国四川省成都市武侯区龙江路14-9号"
                    },
                    {
                        "pos": [
                            "104.069344",
                            "30.600637"
                        ],
                        "time": "2017-10-30 17:44:05",
                        "address": "中国四川省成都市武侯区天益街38号-4栋-附12号"
                    },
                    {
                        "pos": [
                            "104.069344",
                            "30.600637"
                        ],
                        "time": "2017-10-30 17:45:05",
                        "address": "中国四川省成都市武侯区天益街38号-4栋-附12号"
                    },
                    {
                        "pos": [
                            "104.069344",
                            "30.600637"
                        ],
                        "time": "2017-10-30 17:46:05",
                        "address": "中国四川省成都市武侯区天益街38号-4栋-附12号"
                    },
                    {
                        "pos": [
                            "104.083734",
                            "30.647601"
                        ],
                        "time": "2017-10-30 17:48:21",
                        "address": "中国四川省成都市武侯区龙江路14-9号"
                    },
                    {
                        "pos": [
                            "104.083734",
                            "30.647601"
                        ],
                        "time": "2017-10-30 17:53:21",
                        "address": "中国四川省成都市武侯区龙江路14-9号"
                    },
                    {
                        "pos": [
                            "104.069344",
                            "30.600637"
                        ],
                        "time": "2017-10-30 17:53:49",
                        "address": "中国四川省成都市武侯区天益街38号-4栋-附12号"
                    },
                    {
                        "pos": [
                            "104.069344",
                            "30.600637"
                        ],
                        "time": "2017-10-30 17:54:49",
                        "address": "中国四川省成都市武侯区天益街38号-4栋-附12号"
                    },
                    {
                        "pos": [
                            "104.069344",
                            "30.600637"
                        ],
                        "time": "2017-10-30 17:55:49",
                        "address": "中国四川省成都市武侯区天益街38号-4栋-附12号"
                    },
                    {
                        "pos": [
                            "104.069344",
                            "30.600637"
                        ],
                        "time": "2017-10-30 17:57:36",
                        "address": "中国四川省成都市武侯区天益街38号-4栋-附12号"
                    },
                    {
                        "pos": [
                            "104.08369",
                            "30.647586"
                        ],
                        "time": "2017-10-30 17:58:21",
                        "address": "中国四川省成都市武侯区龙江路14-8号"
                    },
                    {
                        "pos": [
                            "104.069232",
                            "30.600451"
                        ],
                        "time": "2017-10-30 17:58:22",
                        "address": "中国四川省成都市武侯区天益街38号-4栋-附12号"
                    },
                    {
                        "pos": [
                            "104.069344",
                            "30.600637"
                        ],
                        "time": "2017-10-30 17:59:39",
                        "address": "中国四川省成都市武侯区天益街38号-4栋-附12号"
                    },
                    {
                        "pos": [
                            "104.08369",
                            "30.647586"
                        ],
                        "time": "2017-10-30 18:03:20",
                        "address": "中国四川省成都市武侯区龙江路14-8号"
                    },
                    {
                        "pos": [
                            "104.083677",
                            "30.647611"
                        ],
                        "time": "2017-10-30 18:06:48",
                        "address": "中国四川省成都市武侯区龙江路14-7号"
                    },
                    {
                        "pos": [
                            "104.083746",
                            "30.647589"
                        ],
                        "time": "2017-10-30 18:09:11",
                        "address": "中国四川省成都市武侯区龙江路14-9号"
                    },
                    {
                        "pos": [
                            "104.083751",
                            "30.647599"
                        ],
                        "time": "2017-10-30 18:11:48",
                        "address": "中国四川省成都市武侯区龙江路14-9号"
                    },
                    {
                        "pos": [
                            "104.083751",
                            "30.647599"
                        ],
                        "time": "2017-10-30 18:14:11",
                        "address": "中国四川省成都市武侯区龙江路14-9号"
                    },
                    {
                        "pos": [
                            "104.083606",
                            "30.647626"
                        ],
                        "time": "2017-10-30 18:17:17",
                        "address": "中国四川省成都市武侯区龙江路14-5号"
                    },
                    {
                        "pos": [
                            "104.085827",
                            "30.647028"
                        ],
                        "time": "2017-10-30 18:24:10",
                        "address": "中国四川省成都市武侯区龙江路19-40号"
                    },
                    {
                        "pos": [
                            "104.093704",
                            "30.659789"
                        ],
                        "time": "2017-10-30 18:35:08",
                        "address": "中国四川省成都市锦江区大慈寺路3号"
                    },
                    {
                        "pos": [
                            "104.070187",
                            "30.600238"
                        ],
                        "time": "2017-10-30 18:35:32",
                        "address": "中国四川省成都市武侯区天益街8号"
                    },
                    {
                        "pos": [
                            "104.070187",
                            "30.600238"
                        ],
                        "time": "2017-10-30 18:36:32",
                        "address": "中国四川省成都市武侯区天益街8号"
                    },
                    {
                        "pos": [
                            "104.070187",
                            "30.600238"
                        ],
                        "time": "2017-10-30 18:38:34",
                        "address": "中国四川省成都市武侯区天益街8号"
                    },
                    {
                        "pos": [
                            "104.095741",
                            "30.667176"
                        ],
                        "time": "2017-10-30 18:43:45",
                        "address": "中国四川省成都市锦江区中道街194号"
                    },
                    {
                        "pos": [
                            "104.095741",
                            "30.667176"
                        ],
                        "time": "2017-10-30 18:47:25",
                        "address": "中国四川省成都市锦江区中道街194号"
                    },
                    {
                        "pos": [
                            "104.094841",
                            "30.666946"
                        ],
                        "time": "2017-10-30 18:52:03",
                        "address": "中国四川省成都市锦江区四圣祠北街21-3号"
                    },
                    {
                        "pos": [
                            "104.070187",
                            "30.600238"
                        ],
                        "time": "2017-10-30 18:57:18",
                        "address": "中国四川省成都市武侯区天益街8号"
                    },
                    {
                        "pos": [
                            "104.070187",
                            "30.600238"
                        ],
                        "time": "2017-10-30 18:58:26",
                        "address": "中国四川省成都市武侯区天益街8号"
                    },
                    {
                        "pos": [
                            "104.094901",
                            "30.666954"
                        ],
                        "time": "2017-10-30 18:59:47",
                        "address": "中国四川省成都市锦江区四圣祠北街21号-附4号"
                    },
                    {
                        "pos": [
                            "104.094947",
                            "30.667082"
                        ],
                        "time": "2017-10-30 19:02:09",
                        "address": "中国四川省成都市锦江区四圣祠北街25号"
                    },
                    {
                        "pos": [
                            "104.094947",
                            "30.667082"
                        ],
                        "time": "2017-10-30 19:04:47",
                        "address": "中国四川省成都市锦江区四圣祠北街25号"
                    },
                    {
                        "pos": [
                            "104.094947",
                            "30.667082"
                        ],
                        "time": "2017-10-30 19:20:29",
                        "address": "中国四川省成都市锦江区四圣祠北街25号"
                    },
                    {
                        "pos": [
                            "104.012031",
                            "30.668811"
                        ],
                        "time": "2017-10-30 20:10:13",
                        "address": "中国四川省成都市青羊区东坡路"
                    },
                    {
                        "pos": [
                            "104.012031",
                            "30.668811"
                        ],
                        "time": "2017-10-30 20:11:27",
                        "address": "中国四川省成都市青羊区东坡路"
                    },
                    {
                        "pos": [
                            "104.012031",
                            "30.668811"
                        ],
                        "time": "2017-10-30 20:12:27",
                        "address": "中国四川省成都市青羊区东坡路"
                    },
                    {
                        "pos": [
                            "104.012031",
                            "30.668811"
                        ],
                        "time": "2017-10-30 20:13:27",
                        "address": "中国四川省成都市青羊区东坡路"
                    },
                    {
                        "pos": [
                            "104.012031",
                            "30.668811"
                        ],
                        "time": "2017-10-30 20:14:27",
                        "address": "中国四川省成都市青羊区东坡路"
                    },
                    {
                        "pos": [
                            "104.012031",
                            "30.668811"
                        ],
                        "time": "2017-10-30 20:15:27",
                        "address": "中国四川省成都市青羊区东坡路"
                    },
                    {
                        "pos": [
                            "104.012031",
                            "30.668811"
                        ],
                        "time": "2017-10-30 20:19:28",
                        "address": "中国四川省成都市青羊区东坡路"
                    },
                    {
                        "pos": [
                            "104.012031",
                            "30.668811"
                        ],
                        "time": "2017-10-30 20:21:06",
                        "address": "中国四川省成都市青羊区东坡路"
                    },
                    {
                        "pos": [
                            "104.012031",
                            "30.668811"
                        ],
                        "time": "2017-10-30 20:22:29",
                        "address": "中国四川省成都市青羊区东坡路"
                    },
                    {
                        "pos": [
                            "104.012031",
                            "30.668811"
                        ],
                        "time": "2017-10-30 20:23:28",
                        "address": "中国四川省成都市青羊区东坡路"
                    },
                    {
                        "pos": [
                            "104.012031",
                            "30.668811"
                        ],
                        "time": "2017-10-30 20:24:29",
                        "address": "中国四川省成都市青羊区东坡路"
                    },
                    {
                        "pos": [
                            "104.012031",
                            "30.668811"
                        ],
                        "time": "2017-10-30 20:25:29",
                        "address": "中国四川省成都市青羊区东坡路"
                    },
                    {
                        "pos": [
                            "104.012031",
                            "30.668811"
                        ],
                        "time": "2017-10-30 20:26:29",
                        "address": "中国四川省成都市青羊区东坡路"
                    },
                    {
                        "pos": [
                            "104.012031",
                            "30.668811"
                        ],
                        "time": "2017-10-30 20:27:29",
                        "address": "中国四川省成都市青羊区东坡路"
                    },
                    {
                        "pos": [
                            "104.012031",
                            "30.668811"
                        ],
                        "time": "2017-10-30 20:28:29",
                        "address": "中国四川省成都市青羊区东坡路"
                    },
                    {
                        "pos": [
                            "104.012031",
                            "30.668811"
                        ],
                        "time": "2017-10-30 20:29:29",
                        "address": "中国四川省成都市青羊区东坡路"
                    },
                    {
                        "pos": [
                            "104.012031",
                            "30.668811"
                        ],
                        "time": "2017-10-30 20:30:29",
                        "address": "中国四川省成都市青羊区东坡路"
                    },
                    {
                        "pos": [
                            "104.012031",
                            "30.668811"
                        ],
                        "time": "2017-10-30 20:31:29",
                        "address": "中国四川省成都市青羊区东坡路"
                    },
                    {
                        "pos": [
                            "104.012031",
                            "30.668811"
                        ],
                        "time": "2017-10-30 20:32:29",
                        "address": "中国四川省成都市青羊区东坡路"
                    },
                    {
                        "pos": [
                            "104.012031",
                            "30.668811"
                        ],
                        "time": "2017-10-30 20:33:29",
                        "address": "中国四川省成都市青羊区东坡路"
                    },
                    {
                        "pos": [
                            "104.012031",
                            "30.668811"
                        ],
                        "time": "2017-10-30 20:34:29",
                        "address": "中国四川省成都市青羊区东坡路"
                    },
                    {
                        "pos": [
                            "104.012031",
                            "30.668811"
                        ],
                        "time": "2017-10-30 20:35:29",
                        "address": "中国四川省成都市青羊区东坡路"
                    },
                    {
                        "pos": [
                            "104.012031",
                            "30.668811"
                        ],
                        "time": "2017-10-30 20:36:29",
                        "address": "中国四川省成都市青羊区东坡路"
                    },
                    {
                        "pos": [
                            "104.012031",
                            "30.668811"
                        ],
                        "time": "2017-10-30 20:37:29",
                        "address": "中国四川省成都市青羊区东坡路"
                    },
                    {
                        "pos": [
                            "104.094947",
                            "30.667082"
                        ],
                        "time": "2017-10-30 20:37:36",
                        "address": "中国四川省成都市锦江区四圣祠北街25号"
                    },
                    {
                        "pos": [
                            "104.012031",
                            "30.668811"
                        ],
                        "time": "2017-10-30 20:38:29",
                        "address": "中国四川省成都市青羊区东坡路"
                    },
                    {
                        "pos": [
                            "104.012031",
                            "30.668811"
                        ],
                        "time": "2017-10-30 20:39:29",
                        "address": "中国四川省成都市青羊区东坡路"
                    },
                    {
                        "pos": [
                            "104.012031",
                            "30.668811"
                        ],
                        "time": "2017-10-30 20:40:29",
                        "address": "中国四川省成都市青羊区东坡路"
                    },
                    {
                        "pos": [
                            "104.012031",
                            "30.668811"
                        ],
                        "time": "2017-10-30 20:41:29",
                        "address": "中国四川省成都市青羊区东坡路"
                    },
                    {
                        "pos": [
                            "104.012031",
                            "30.668811"
                        ],
                        "time": "2017-10-30 20:42:29",
                        "address": "中国四川省成都市青羊区东坡路"
                    },
                    {
                        "pos": [
                            "104.012031",
                            "30.668811"
                        ],
                        "time": "2017-10-30 20:43:29",
                        "address": "中国四川省成都市青羊区东坡路"
                    },
                    {
                        "pos": [
                            "104.012031",
                            "30.668811"
                        ],
                        "time": "2017-10-30 20:44:29",
                        "address": "中国四川省成都市青羊区东坡路"
                    },
                    {
                        "pos": [
                            "104.012031",
                            "30.668811"
                        ],
                        "time": "2017-10-30 20:45:29",
                        "address": "中国四川省成都市青羊区东坡路"
                    }
                ]
            }
        ]
    },
    {
        "id": "Y2017102920323320",
        "status": "运输中",
        "transportType": "普通药物",
        "goods": [
            {
                "name": "板蓝根",
                "factory": "太极制药",
                "number": "50"
            },
            {
                "name": "同仁堂蜜丸",
                "factory": "同仁堂",
                "number": "25"
            }
        ],
        "currentPos": {
            "address": "陕西省西安市户县",
            "pos" : [108.581289, 34.022743],
            "time" : "2017-08-12 13:56:02"
        },
        "dispatchData": [
            {
                "id": "Z2017102920330322_1",
                "startPos": {
                    "address" : "陕西省西安市户县",
                    "pos" : [108.585726, 34.022683]
                },
                "endPos": {
                    "address": "addr10",
                    "pos" : [108.58288, 34.023229]
                },
                "portraitUrl": null,
                "name": "付代成",
                "tel": "13458588890",
                "driveTime": "000000510101079302",
                "carNumber": "川A99999",
                "company": "承运商B",
                "consignor": "货主公司A",
                "consignee": "张家口第一人民医院",
                "containerTemp": "-2℃",
                "outdoorTemp": "33℃",
                "posList": [
                    {
                      "address": "addr1zzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzssssssssssswwwwwwwwww",
                        "pos" : [108.585726, 34.022683],
                        "time" : "2017-08-12 13:31:02"
                    }, {
                      "address": "addr2",
                        "pos" : [108.58482, 34.022569],
                        "time" : "2017-08-12 13:32:42"
                    }, {
                      "address": "addr3",
                        "pos" : [108.584104, 34.022708],
                        "time" : "2017-08-12 13:34:22"
                    }, {
                      "address": "addr4",
                        "pos" : [108.583696, 34.022822],
                        "time" : "2017-08-12 13:36:02"
                    }, {
                      "address": "addr5",
                        "pos" : [108.583049, 34.022691],
                        "time" : "2017-08-12 13:37:42"
                    }, {
                      "address": "addr6",
                        "pos" : [108.58283, 34.022708],
                        "time" : "2017-08-12 13:39:22"
                    }, {
                      "address": "addr7",
                        "pos" : [108.582602, 34.022794],
                        "time" : "2017-08-12 13:41:02"
                    }, {
                      "address": "addr8",
                        "pos" : [108.582562, 34.022843],
                        "time" : "2017-08-12 13:42:42"
                    }, {
                      "address": "addr9",
                        "pos" : [108.582791, 34.023007],
                        "time" : "2017-08-12 13:44:22"
                    }, {
                      "address": "addr10",
                        "pos" : [108.58288, 34.023229],
                        "time" : "2017-08-12 13:46:02"
                    }
                ]
            },
            {
                "id": "Z2017102920330322_2",
                "startPos": {
                    "address" : "addr10",
                    "pos" : [108.58288, 34.023229]
                },
                "endPos": {
                    "address": "陕西省西安市长安区",
                    "pos" : [108.791061, 34.169017]
                },
                "portraitUrl": null,
                "name": "fjs",
                "tel": "13458588890",
                "driveTime": "000000510101079302",
                "carNumber": "川A99999",
                "company": "承运商B",
                "consignor": "货主公司A",
                "consignee": "成都第一人民医院",
                "containerTemp": "-3℃",
                "outdoorTemp": "25℃",
                "posList": [
                    {
                        "address": "addr10",
                        "pos" : [108.58288, 34.023229],
                        "time" : "2017-08-12 13:46:02"
                    }, {
                      "address": "addr11",
                        "pos" : [108.58285, 34.023378],
                        "time" : "2017-08-12 13:47:42"
                    }, {
                      "address": "addr12",
                        "pos" : [108.58277, 34.023437],
                        "time" : "2017-08-12 13:49:22"
                    }, {
                      "address": "addr13",
                        "pos" : [108.582641, 34.023445],
                        "time" : "2017-08-12 13:51:02"
                    }, {
                      "address": "addr4",
                        "pos" : [108.582174, 34.023187],
                        "time" : "2017-08-12 13:52:42"
                    }, {
                      "address": "addr15",
                        "pos" : [108.581597, 34.022968],
                        "time" : "2017-08-12 13:54:22"
                    }, {
                      "address": "addr16",
                        "pos" : [108.581289, 34.022743],
                        "time" : "2017-08-12 13:56:02"
                    }
                ]
            }
        ]
    }
]


var orderList = [
    {
     	"id":"D2017102920323320",
     	"transportList": [
     		{
         		"id": "Y2017102920323320",
                "status": "运输中",
                "carNumber": "川A99999",
                "currentPos": {
                    "pos": ["104.012031","30.668811"],
                    "time": "2017-10-30 20:45:29",
                    "address": "中国四川省成都市青羊区东坡路"
                }
         	}, 
     		{
         		"id": "Y2017102920323321",
                "status": "运输中",
                "carNumber": "川A12345",
                "currentPos": {
                	"pos": [111.926433, 38.569585],
                    "time": "2017-10-30 20:45:29",
                     "address": "山西省忻州市静乐县"
                }
         	}
     	]
    },
    {
        "id":"D2017102920323321",
        "transportList": [
            {
                "id": "Y2017102920323323",
                "status": "运输中",
                "carNumber": "粤A44444",
                "currentPos": {
                	"pos" : [112.710881, 35.015931],
                    "addr" : "河南省焦作市孟州市S309",
                    "time": "2017-10-30 20:45:29",
                    "address": "中国四川省成都市青羊区东坡路"
                }
            }, 
            {
                "id": "Y2017102920323324",
                "status": "运输中",
                "carNumber": "陕A33333",
                "currentPos": {
                    "pos" : [113.511351, 32.315865],
                    "time": "2017-10-30 20:45:29",
                    "address": "湖北省随州市随县"
                }
            }
        ]
    }
];